nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1152xxxxx
package_id: MIMXRT1152XHM8B
mcu_data: ksdk2_0
processor_version: 0.0.0
board: FRDM-MIMXRT1150
pin_labels:
- {pin_num: AD18, pin_signal: PMIC_ON_REQ, label: PMIC_ON_REQ, identifier: SW6}
- {pin_num: N3, pin_signal: GPIO_EMC_B1_36, label: GPIO_EMC_B1_36, identifier: GREEN_LED}
- {pin_num: Y24, pin_signal: GPIO_AD_06, label: 'J51[8]', identifier: CUR_C;CUR_C_ADC1}
- {pin_num: W23, pin_signal: GPIO_AD_07, label: 'J51[6]', identifier: VOLT_DCB;VOLT_DCB_ADC1}
- {pin_num: T24, pin_signal: GPIO_AD_12, label: 'J51[4]/J2[1]', identifier: GPIO_AD_12;CUR_A;CUR_A2;CUR_A1;CUR_A_ADC1;CUR_A_ADC2}
- {pin_num: U25, pin_signal: GPIO_AD_13, label: 'J51[2]/J2[3]', identifier: GPIO_AD_13;CUR_B1;CUR_B2;CUR_B_ADC1;CUR_B_ADC2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitPWM();
    BOARD_InitADC();
    BOARD_InitCMP();
    BOARD_InitENC();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N1, peripheral: GPIO7, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_B1_21, direction: OUTPUT}
  - {pin_num: N3, peripheral: GPIO8, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_B1_36, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of FLEXIO_21 on GPIO_EMC_B1_21 (pin N1) */
  gpio_pin_config_t FLEXIO_21_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_21 (pin N1) */
  GPIO_PinInit(GPIO7, 21U, &FLEXIO_21_config);

  /* GPIO configuration of GREEN_LED on GPIO_EMC_B1_36 (pin N3) */
  gpio_pin_config_t GREEN_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_36 (pin N3) */
  GPIO_PinInit(GPIO8, 4U, &GREEN_LED_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_21_GPIO7_IO21,       /* GPIO_EMC_B1_21 is configured as GPIO7_IO21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_36_GPIO8_IO04,       /* GPIO_EMC_B1_36 is configured as GPIO8_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T18, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25}
  - {pin_num: T19, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUARTPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: V19, peripheral: LPUART8, signal: RTS_B, pin_signal: GPIO_AD_05}
  - {pin_num: Y19, peripheral: LPUART8, signal: TXD, pin_signal: GPIO_AD_02}
  - {pin_num: W25, peripheral: LPUART8, signal: RXD, pin_signal: GPIO_AD_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

