nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_LPUART8_TXD,          /* GPIO_AD_02 is configured as LPUART8_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_03_LPUART8_RXD,          /* GPIO_AD_03 is configured as LPUART8_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_LPUART8_RTS_B,        /* GPIO_AD_05 is configured as LPUART8_RTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G1, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_00, direction: OUTPUT, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: H2, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_01, direction: OUTPUT, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: K7, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_02, direction: OUTPUT, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: E3, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_03, direction: OUTPUT, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: L3, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_04, direction: OUTPUT, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: F2, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_05, direction: OUTPUT, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {peripheral: PWM4, signal: 'FAULT, 0', pin_signal: ACMP2_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A,  /* GPIO_EMC_B1_00 is configured as FLEXPWM4_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B,  /* GPIO_EMC_B1_01 is configured as FLEXPWM4_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A,  /* GPIO_EMC_B1_02 is configured as FLEXPWM4_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_FLEXPWM4_PWM1_B,  /* GPIO_EMC_B1_03 is configured as FLEXPWM4_PWM1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A,  /* GPIO_EMC_B1_04 is configured as FLEXPWM4_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_FLEXPWM4_PWM2_B,  /* GPIO_EMC_B1_05 is configured as FLEXPWM4_PWM2_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputAcmp2Out, kXBARA1_OutputFlexpwm4Fault0); /* ACMP2_OUT output assigned to XBARA1_IN43 input is connected to XBARA1_OUT91 output assigned to FLEXPWM4_FAULT0 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A,  /* GPIO_EMC_B1_00 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B,  /* GPIO_EMC_B1_01 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A,  /* GPIO_EMC_B1_02 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_03_FLEXPWM4_PWM1_B,  /* GPIO_EMC_B1_03 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A,  /* GPIO_EMC_B1_04 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_05_FLEXPWM4_PWM2_B,  /* GPIO_EMC_B1_05 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

