nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T24, peripheral: LPADC1, signal: 'A, 1_3', pin_signal: GPIO_AD_12, identifier: CUR_A_ADC1}
  - {pin_num: T24, peripheral: LPADC2, signal: 'A, 2_3', pin_signal: GPIO_AD_12, identifier: CUR_A_ADC2}
  - {pin_num: U25, peripheral: LPADC1, signal: 'B, 1_3', pin_signal: GPIO_AD_13, identifier: CUR_B_ADC1}
  - {pin_num: U25, peripheral: LPADC2, signal: 'B, 2_3', pin_signal: GPIO_AD_13, identifier: CUR_B_ADC2}
  - {pin_num: Y24, peripheral: LPADC1, signal: 'A, 1_0', pin_signal: GPIO_AD_06, identifier: CUR_C_ADC1}
  - {pin_num: W23, peripheral: LPADC1, signal: 'B, 1_0', pin_signal: GPIO_AD_07, identifier: VOLT_DCB_ADC1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_06_GPIO_MUX3_IO05,       /* GPIO_AD_06 is configured as GPIO_MUX3_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_07_GPIO_MUX3_IO06,       /* GPIO_AD_07 is configured as GPIO_MUX3_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_GPIO_MUX3_IO11,       /* GPIO_AD_12 is configured as GPIO_MUX3_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_GPIO_MUX3_IO12,       /* GPIO_AD_13 is configured as GPIO_MUX3_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMP:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: R23, peripheral: CMP2, signal: 'IN, 4', pin_signal: GPIO_AD_27}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMP, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCMP(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_GPIO_MUX3_IO26,       /* GPIO_AD_27 is configured as GPIO_MUX3_IO26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B4, peripheral: ENC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: C1, peripheral: ENC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_13}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_XBAR1_INOUT04,    /* GPIO_EMC_B1_12 is configured as XBAR1_INOUT04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_XBAR1_INOUT05,    /* GPIO_EMC_B1_13 is configured as XBAR1_INOUT05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR20 = ((IOMUXC_GPR->GPR20 &
    (~(IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: 0x00U */
    );
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout04, kXBARA1_OutputDec1Phasea); /* IOMUX_XBAR_INOUT04 output assigned to XBARA1_IN4 input is connected to XBARA1_OUT108 output assigned to DEC1_PHASEA */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout05, kXBARA1_OutputDec1Phaseb); /* IOMUX_XBAR_INOUT05 output assigned to XBARA1_IN5 input is connected to XBARA1_OUT109 output assigned to DEC1_PHASEB */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
